
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 5 to add, 5 to change, 51 to destroy.</code></pre>

* Update
  * azurerm_key_vault_secret.flexible_secret_staging[&#34;database&#34;]
  * azurerm_key_vault_secret.flexible_secret_staging[&#34;host&#34;]
  * azurerm_key_vault_secret.flexible_secret_staging[&#34;pass&#34;]
  * azurerm_key_vault_secret.flexible_secret_staging[&#34;port&#34;]
  * azurerm_key_vault_secret.flexible_secret_staging[&#34;user&#34;]
* Delete
  * azurerm_key_vault_secret.db_database
  * azurerm_key_vault_secret.db_host
  * azurerm_key_vault_secret.db_password
  * azurerm_key_vault_secret.db_port
  * azurerm_key_vault_secret.db_user
  * azurerm_key_vault_secret.staging_db_database
  * azurerm_key_vault_secret.staging_db_host
  * azurerm_key_vault_secret.staging_db_password
  * azurerm_key_vault_secret.staging_db_port
  * azurerm_key_vault_secret.staging_db_user
  * module.reform-notifications-db.azurerm_postgresql_active_directory_administrator.admin
  * module.reform-notifications-db.azurerm_resource_group.data-resourcegroup
  * module.reform-notifications-db.azurerm_template_deployment.postgres-paas
  * module.reform-notifications-db.null_resource.subnet_mappings[0]
  * module.reform-notifications-db.null_resource.subnet_mappings[1]
  * module.reform-notifications-db.null_resource.subnet_mappings[2]
  * module.reform-notifications-db.null_resource.subnet_mappings[3]
  * module.reform-notifications-db.null_resource.subnet_mappings[4]
  * module.reform-notifications-db.null_resource.subnet_mappings[5]
  * module.reform-notifications-db.null_resource.subnet_mappings[6]
  * module.reform-notifications-db.null_resource.subnet_mappings[7]
  * module.reform-notifications-db.null_resource.subnet_mappings[8]
  * module.reform-notifications-db.null_resource.subnet_mappings[9]
  * module.reform-notifications-db.null_resource.subnet_mappings[10]
  * module.reform-notifications-db.null_resource.subnet_mappings[11]
  * module.reform-notifications-db.null_resource.subnet_mappings[12]
  * module.reform-notifications-db.null_resource.subnet_mappings[13]
  * module.reform-notifications-db.random_string.password
  * module.reform-notifications-staging-db.azurerm_postgresql_active_directory_administrator.admin
  * module.reform-notifications-staging-db.azurerm_resource_group.data-resourcegroup
  * module.reform-notifications-staging-db.azurerm_template_deployment.postgres-paas
  * module.reform-notifications-staging-db.null_resource.subnet_mappings[0]
  * module.reform-notifications-staging-db.null_resource.subnet_mappings[1]
  * module.reform-notifications-staging-db.null_resource.subnet_mappings[2]
  * module.reform-notifications-staging-db.null_resource.subnet_mappings[3]
  * module.reform-notifications-staging-db.null_resource.subnet_mappings[4]
  * module.reform-notifications-staging-db.null_resource.subnet_mappings[5]
  * module.reform-notifications-staging-db.null_resource.subnet_mappings[6]
  * module.reform-notifications-staging-db.null_resource.subnet_mappings[7]
  * module.reform-notifications-staging-db.null_resource.subnet_mappings[8]
  * module.reform-notifications-staging-db.null_resource.subnet_mappings[9]
  * module.reform-notifications-staging-db.null_resource.subnet_mappings[10]
  * module.reform-notifications-staging-db.null_resource.subnet_mappings[11]
  * module.reform-notifications-staging-db.null_resource.subnet_mappings[12]
  * module.reform-notifications-staging-db.null_resource.subnet_mappings[13]
  * module.reform-notifications-staging-db.random_string.password
* Replace
  * azurerm_key_vault_secret.flexible_secret[&#34;DATABASE&#34;]
  * azurerm_key_vault_secret.flexible_secret[&#34;HOST&#34;]
  * azurerm_key_vault_secret.flexible_secret[&#34;PASS&#34;]
  * azurerm_key_vault_secret.flexible_secret[&#34;PORT&#34;]
  * azurerm_key_vault_secret.flexible_secret[&#34;USER&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.db_database will be destroyed
  # (because azurerm_key_vault_secret.db_database is not in configuration)
  - resource "azurerm_key_vault_secret" "db_database" {
      - id                      = "https://reform-scan-aat.vault.azure.net/secrets/notification-service-POSTGRES-DATABASE/b2d6a5a9d05545678d0dded23a7c3438" -> null
      - key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/reform-scan-aat/providers/Microsoft.KeyVault/vaults/reform-scan-aat" -> null
      - name                    = "notification-service-POSTGRES-DATABASE" -> null
      - resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/reform-scan-aat/providers/Microsoft.KeyVault/vaults/reform-scan-aat/secrets/notification-service-POSTGRES-DATABASE/versions/b2d6a5a9d05545678d0dded23a7c3438" -> null
      - resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/reform-scan-aat/providers/Microsoft.KeyVault/vaults/reform-scan-aat/secrets/notification-service-POSTGRES-DATABASE" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value) -> null
      - version                 = "b2d6a5a9d05545678d0dded23a7c3438" -> null
      - versionless_id          = "https://reform-scan-aat.vault.azure.net/secrets/notification-service-POSTGRES-DATABASE" -> null
    }

  # azurerm_key_vault_secret.db_host will be destroyed
  # (because azurerm_key_vault_secret.db_host is not in configuration)
  - resource "azurerm_key_vault_secret" "db_host" {
      - id                      = "https://reform-scan-aat.vault.azure.net/secrets/notification-service-POSTGRES-HOST/6303ad42f3ab4fd08ef051ae92e95612" -> null
      - key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/reform-scan-aat/providers/Microsoft.KeyVault/vaults/reform-scan-aat" -> null
      - name                    = "notification-service-POSTGRES-HOST" -> null
      - resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/reform-scan-aat/providers/Microsoft.KeyVault/vaults/reform-scan-aat/secrets/notification-service-POSTGRES-HOST/versions/6303ad42f3ab4fd08ef051ae92e95612" -> null
      - resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/reform-scan-aat/providers/Microsoft.KeyVault/vaults/reform-scan-aat/secrets/notification-service-POSTGRES-HOST" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value) -> null
      - version                 = "6303ad42f3ab4fd08ef051ae92e95612" -> null
      - versionless_id          = "https://reform-scan-aat.vault.azure.net/secrets/notification-service-POSTGRES-HOST" -> null
    }

  # azurerm_key_vault_secret.db_password will be destroyed
  # (because azurerm_key_vault_secret.db_password is not in configuration)
  - resource "azurerm_key_vault_secret" "db_password" {
      - id                      = "https://reform-scan-aat.vault.azure.net/secrets/notification-service-POSTGRES-PASS/c62d578ce64a4411a655988d4c07168c" -> null
      - key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/reform-scan-aat/providers/Microsoft.KeyVault/vaults/reform-scan-aat" -> null
      - name                    = "notification-service-POSTGRES-PASS" -> null
      - resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/reform-scan-aat/providers/Microsoft.KeyVault/vaults/reform-scan-aat/secrets/notification-service-POSTGRES-PASS/versions/c62d578ce64a4411a655988d4c07168c" -> null
      - resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/reform-scan-aat/providers/Microsoft.KeyVault/vaults/reform-scan-aat/secrets/notification-service-POSTGRES-PASS" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value) -> null
      - version                 = "c62d578ce64a4411a655988d4c07168c" -> null
      - versionless_id          = "https://reform-scan-aat.vault.azure.net/secrets/notification-service-POSTGRES-PASS" -> null
    }

  # azurerm_key_vault_secret.db_port will be destroyed
  # (because azurerm_key_vault_secret.db_port is not in configuration)
  - resource "azurerm_key_vault_secret" "db_port" {
      - id                      = "https://reform-scan-aat.vault.azure.net/secrets/notification-service-POSTGRES-PORT/fcc47b52fc7a4ae4a5e4f1a273bf8351" -> null
      - key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/reform-scan-aat/providers/Microsoft.KeyVault/vaults/reform-scan-aat" -> null
      - name                    = "notification-service-POSTGRES-PORT" -> null
      - resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/reform-scan-aat/providers/Microsoft.KeyVault/vaults/reform-scan-aat/secrets/notification-service-POSTGRES-PORT/versions/fcc47b52fc7a4ae4a5e4f1a273bf8351" -> null
      - resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/reform-scan-aat/providers/Microsoft.KeyVault/vaults/reform-scan-aat/secrets/notification-service-POSTGRES-PORT" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value) -> null
      - version                 = "fcc47b52fc7a4ae4a5e4f1a273bf8351" -> null
      - versionless_id          = "https://reform-scan-aat.vault.azure.net/secrets/notification-service-POSTGRES-PORT" -> null
    }

  # azurerm_key_vault_secret.db_user will be destroyed
  # (because azurerm_key_vault_secret.db_user is not in configuration)
  - resource "azurerm_key_vault_secret" "db_user" {
      - id                      = "https://reform-scan-aat.vault.azure.net/secrets/notification-service-POSTGRES-USER/87e8f3b5144f414eac80eb7316e6cb82" -> null
      - key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/reform-scan-aat/providers/Microsoft.KeyVault/vaults/reform-scan-aat" -> null
      - name                    = "notification-service-POSTGRES-USER" -> null
      - resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/reform-scan-aat/providers/Microsoft.KeyVault/vaults/reform-scan-aat/secrets/notification-service-POSTGRES-USER/versions/87e8f3b5144f414eac80eb7316e6cb82" -> null
      - resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/reform-scan-aat/providers/Microsoft.KeyVault/vaults/reform-scan-aat/secrets/notification-service-POSTGRES-USER" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value) -> null
      - version                 = "87e8f3b5144f414eac80eb7316e6cb82" -> null
      - versionless_id          = "https://reform-scan-aat.vault.azure.net/secrets/notification-service-POSTGRES-USER" -> null
    }

  # azurerm_key_vault_secret.flexible_secret["DATABASE"] must be replaced
-/+ resource "azurerm_key_vault_secret" "flexible_secret" {
      ~ expiration_date         = "2026-03-05T14:11:56Z" -> (known after apply)
      ~ id                      = "https://reform-scan-aat.vault.azure.net/secrets/notification-service-POSTGRES-FLEXIBLE-DATABASE/ecbc15d9f5f343c8b48d284051f6249e" -> (known after apply)
      ~ name                    = "notification-service-POSTGRES-FLEXIBLE-DATABASE" -> "notification-service-POSTGRES-DATABASE" # forces replacement
      ~ resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/reform-scan-aat/providers/Microsoft.KeyVault/vaults/reform-scan-aat/secrets/notification-service-POSTGRES-FLEXIBLE-DATABASE/versions/ecbc15d9f5f343c8b48d284051f6249e" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/reform-scan-aat/providers/Microsoft.KeyVault/vaults/reform-scan-aat/secrets/notification-service-POSTGRES-FLEXIBLE-DATABASE" -> (known after apply)
        tags                    = {
            "application"         = "bulk-scan-print"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/reform-scan-notification-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "staging"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "notification-service PostgreSQL"
        }
      ~ version                 = "ecbc15d9f5f343c8b48d284051f6249e" -> (known after apply)
      ~ versionless_id          = "https://reform-scan-aat.vault.azure.net/secrets/notification-service-POSTGRES-FLEXIBLE-DATABASE" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret["HOST"] must be replaced
-/+ resource "azurerm_key_vault_secret" "flexible_secret" {
      ~ expiration_date         = "2026-03-05T14:11:56Z" -> (known after apply)
      ~ id                      = "https://reform-scan-aat.vault.azure.net/secrets/notification-service-POSTGRES-FLEXIBLE-HOST/af9c546d82264e418d7d915c56c44de0" -> (known after apply)
      ~ name                    = "notification-service-POSTGRES-FLEXIBLE-HOST" -> "notification-service-POSTGRES-HOST" # forces replacement
      ~ resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/reform-scan-aat/providers/Microsoft.KeyVault/vaults/reform-scan-aat/secrets/notification-service-POSTGRES-FLEXIBLE-HOST/versions/af9c546d82264e418d7d915c56c44de0" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/reform-scan-aat/providers/Microsoft.KeyVault/vaults/reform-scan-aat/secrets/notification-service-POSTGRES-FLEXIBLE-HOST" -> (known after apply)
        tags                    = {
            "application"         = "bulk-scan-print"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/reform-scan-notification-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "staging"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "notification-service PostgreSQL"
        }
      ~ version                 = "af9c546d82264e418d7d915c56c44de0" -> (known after apply)
      ~ versionless_id          = "https://reform-scan-aat.vault.azure.net/secrets/notification-service-POSTGRES-FLEXIBLE-HOST" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret["PASS"] must be replaced
-/+ resource "azurerm_key_vault_secret" "flexible_secret" {
      ~ expiration_date         = "2026-03-05T14:11:56Z" -> (known after apply)
      ~ id                      = "https://reform-scan-aat.vault.azure.net/secrets/notification-service-POSTGRES-FLEXIBLE-PASS/2d86cbad29aa46519c01ff7538394daf" -> (known after apply)
      ~ name                    = "notification-service-POSTGRES-FLEXIBLE-PASS" -> "notification-service-POSTGRES-PASS" # forces replacement
      ~ resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/reform-scan-aat/providers/Microsoft.KeyVault/vaults/reform-scan-aat/secrets/notification-service-POSTGRES-FLEXIBLE-PASS/versions/2d86cbad29aa46519c01ff7538394daf" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/reform-scan-aat/providers/Microsoft.KeyVault/vaults/reform-scan-aat/secrets/notification-service-POSTGRES-FLEXIBLE-PASS" -> (known after apply)
        tags                    = {
            "application"         = "bulk-scan-print"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/reform-scan-notification-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "staging"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "notification-service PostgreSQL"
        }
      ~ version                 = "2d86cbad29aa46519c01ff7538394daf" -> (known after apply)
      ~ versionless_id          = "https://reform-scan-aat.vault.azure.net/secrets/notification-service-POSTGRES-FLEXIBLE-PASS" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret["PORT"] must be replaced
-/+ resource "azurerm_key_vault_secret" "flexible_secret" {
      ~ expiration_date         = "2026-03-05T14:11:56Z" -> (known after apply)
      ~ id                      = "https://reform-scan-aat.vault.azure.net/secrets/notification-service-POSTGRES-FLEXIBLE-PORT/a1dfb099b11f43fb91feb7a50dda6a0c" -> (known after apply)
      ~ name                    = "notification-service-POSTGRES-FLEXIBLE-PORT" -> "notification-service-POSTGRES-PORT" # forces replacement
      ~ resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/reform-scan-aat/providers/Microsoft.KeyVault/vaults/reform-scan-aat/secrets/notification-service-POSTGRES-FLEXIBLE-PORT/versions/a1dfb099b11f43fb91feb7a50dda6a0c" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/reform-scan-aat/providers/Microsoft.KeyVault/vaults/reform-scan-aat/secrets/notification-service-POSTGRES-FLEXIBLE-PORT" -> (known after apply)
        tags                    = {
            "application"         = "bulk-scan-print"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/reform-scan-notification-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "staging"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "notification-service PostgreSQL"
        }
      ~ version                 = "a1dfb099b11f43fb91feb7a50dda6a0c" -> (known after apply)
      ~ versionless_id          = "https://reform-scan-aat.vault.azure.net/secrets/notification-service-POSTGRES-FLEXIBLE-PORT" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret["USER"] must be replaced
-/+ resource "azurerm_key_vault_secret" "flexible_secret" {
      ~ expiration_date         = "2026-03-05T14:11:56Z" -> (known after apply)
      ~ id                      = "https://reform-scan-aat.vault.azure.net/secrets/notification-service-POSTGRES-FLEXIBLE-USER/6cac12c3132a40b585c955d9389c6fce" -> (known after apply)
      ~ name                    = "notification-service-POSTGRES-FLEXIBLE-USER" -> "notification-service-POSTGRES-USER" # forces replacement
      ~ resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/reform-scan-aat/providers/Microsoft.KeyVault/vaults/reform-scan-aat/secrets/notification-service-POSTGRES-FLEXIBLE-USER/versions/6cac12c3132a40b585c955d9389c6fce" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/reform-scan-aat/providers/Microsoft.KeyVault/vaults/reform-scan-aat/secrets/notification-service-POSTGRES-FLEXIBLE-USER" -> (known after apply)
        tags                    = {
            "application"         = "bulk-scan-print"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/reform-scan-notification-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "staging"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "notification-service PostgreSQL"
        }
      ~ version                 = "6cac12c3132a40b585c955d9389c6fce" -> (known after apply)
      ~ versionless_id          = "https://reform-scan-aat.vault.azure.net/secrets/notification-service-POSTGRES-FLEXIBLE-USER" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret_staging["database"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret_staging" {
      ~ expiration_date         = "2026-03-05T14:11:56Z" -> (known after apply)
        id                      = "https://reform-scan-aat.vault.azure.net/secrets/notification-service-staging-db-flexible-database/d77bbd705a7d49f4be421f4c6cfaa043"
        name                    = "notification-service-staging-db-flexible-database"
        tags                    = {
            "application"         = "bulk-scan-print"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/reform-scan-notification-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "staging"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "notification-service PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret_staging["host"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret_staging" {
      ~ expiration_date         = "2026-03-05T14:11:56Z" -> (known after apply)
        id                      = "https://reform-scan-aat.vault.azure.net/secrets/notification-service-staging-db-flexible-host/b4f9336e3f264127b9016272c873e815"
        name                    = "notification-service-staging-db-flexible-host"
        tags                    = {
            "application"         = "bulk-scan-print"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/reform-scan-notification-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "staging"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "notification-service PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret_staging["pass"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret_staging" {
      ~ expiration_date         = "2026-03-05T14:11:56Z" -> (known after apply)
        id                      = "https://reform-scan-aat.vault.azure.net/secrets/notification-service-staging-db-flexible-pass/357dc3b29c754d51814bb9a53931144e"
        name                    = "notification-service-staging-db-flexible-pass"
        tags                    = {
            "application"         = "bulk-scan-print"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/reform-scan-notification-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "staging"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "notification-service PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret_staging["port"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret_staging" {
      ~ expiration_date         = "2026-03-05T14:11:56Z" -> (known after apply)
        id                      = "https://reform-scan-aat.vault.azure.net/secrets/notification-service-staging-db-flexible-port/f42e2d307ea4410f858f5b40ac609379"
        name                    = "notification-service-staging-db-

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

jb3JlLWluZnJhLXZuZXQtYWF0L3N1Ym5ldHMvYWtzIn0seyJydWxlX25hbWUiOiJqZW5raW5zLWFrcyIsInN1Ym5ldF9pZCI6Ii9zdWJzY3JpcHRpb25zLzFiYWY1NDcwLTFjM2UtNDBkMy1hNmY3LTc0YmZiY2U0YjM0OC9yZXNvdXJjZUdyb3Vwcy9jZnQtcHRsLW5ldHdvcmstcmcvcHJvdmlkZXJzL01pY3Jvc29mdC5OZXR3b3JrL3ZpcnR1YWxOZXR3b3Jrcy9jZnQtcHRsLXZuZXQvc3VibmV0cy9pYWFzIn0seyJydWxlX25hbWUiOiJqZW5raW5zLWFrcy1hZ2VudCIsInN1Ym5ldF9pZCI6Ii9zdWJzY3JpcHRpb25zLzFiYWY1NDcwLTFjM2UtNDBkMy1hNmY3LTc0YmZiY2U0YjM0OC9yZXNvdXJjZUdyb3Vwcy9jZnQtcHRsLW5ldHdvcmstcmcvcHJvdmlkZXJzL01pY3Jvc29mdC5OZXR3b3JrL3ZpcnR1YWxOZXR3b3Jrcy9jZnQtcHRsLXZuZXQvc3VibmV0cy9ha3MtMDAifSx7InJ1bGVfbmFtZSI6InNoYXJlZC1zZXJ2aWNlcy10ZXN0LWFrczAwIiwic3VibmV0X2lkIjoiL3N1YnNjcmlwdGlvbnMvM2VlYzViZGUtN2ZlYi00NTY2LWJmYjYtODA1ZGY2ZTEwYjkwL3Jlc291cmNlR3JvdXBzL3NzLXRlc3QtbmV0d29yay1yZy9wcm92aWRlcnMvTWljcm9zb2Z0Lk5ldHdvcmsvdmlydHVhbE5ldHdvcmtzL3NzLXRlc3Qtdm5ldC9zdWJuZXRzL2Frcy0wMCJ9LHsicnVsZV9uYW1lIjoic2hhcmVkLXNlcnZpY2VzLXRlc3QtYWtzMDEiLCJzdWJuZXRfaWQiOiIvc3Vic2NyaXB0aW9ucy8zZWVjNWJkZS03ZmViLTQ1NjYtYmZiNi04MDVkZjZlMTBiOTAvcmVzb3VyY2VHcm91cHMvc3MtdGVzdC1uZXR3b3JrLXJnL3Byb3ZpZGVycy9NaWNyb3NvZnQuTmV0d29yay92aXJ0dWFsTmV0d29ya3Mvc3MtdGVzdC12bmV0L3N1Ym5ldHMvYWtzLTAxIn0seyJydWxlX25hbWUiOiJzaGFyZWQtc2VydmljZXMtc3RnLWFrczAwIiwic3VibmV0X2lkIjoiL3N1YnNjcmlwdGlvbnMvNzRkYWNkNGYtYTI0OC00NWJiLWEyZjAtYWY3MDBkYzRjZjY4L3Jlc291cmNlR3JvdXBzL3NzLXN0Zy1uZXR3b3JrLXJnL3Byb3ZpZGVycy9NaWNyb3NvZnQuTmV0d29yay92aXJ0dWFsTmV0d29ya3Mvc3Mtc3RnLXZuZXQvc3VibmV0cy9ha3MtMDAifSx7InJ1bGVfbmFtZSI6InNoYXJlZC1zZXJ2aWNlcy1zdGctYWtzMDEiLCJzdWJuZXRfaWQiOiIvc3Vic2NyaXB0aW9ucy83NGRhY2Q0Zi1hMjQ4LTQ1YmItYTJmMC1hZjcwMGRjNGNmNjgvcmVzb3VyY2VHcm91cHMvc3Mtc3RnLW5ldHdvcmstcmcvcHJvdmlkZXJzL01pY3Jvc29mdC5OZXR3b3JrL3ZpcnR1YWxOZXR3b3Jrcy9zcy1zdGctdm5ldC9zdWJuZXRzL2Frcy0wMSJ9LHsicnVsZV9uYW1lIjoiYmFzdGlvbi1ub25wcm9kLXZuZXQiLCJzdWJuZXRfaWQiOiIvc3Vic2NyaXB0aW9ucy9iNDRlYjQ3OS05YWUyLTQyZTctOWM2My1mM2M1OTk3MTliNmYvcmVzb3VyY2VHcm91cHMvYmFzdGlvbi1ub25wcm9kLXJnL3Byb3ZpZGVycy9NaWNyb3NvZnQuTmV0d29yay92aXJ0dWFsTmV0d29ya3MvYmFzdGlvbi1ub25wcm9kLXZuZXQvc3VibmV0cy9iYXN0aW9uIn0seyJydWxlX25hbWUiOiJpZGFtLWFhdDItdm5ldCIsInN1Ym5ldF9pZCI6Ii9zdWJzY3JpcHRpb25zLzFjNGYwNzA0LWEyOWUtNDAzZC1iNzE5LWI5MGMzNGVmMTRjOS9yZXNvdXJjZUdyb3Vwcy9jb3JlLWluZnJhLWlkYW0tYWF0Mi9wcm92aWRlcnMvTWljcm9zb2Z0Lk5ldHdvcmsvdmlydHVhbE5ldHdvcmtzL2NvcmUtaW5mcmEtdm5ldC1pZGFtLWFhdDIvc3VibmV0cy9jb3JlLWluZnJhLXN1Ym5ldC03LWlkYW0tYWF0MiJ9LHsicnVsZV9uYW1lIjoic2hhcmVkLXNlcnZpY2VzLWRldi1ha3MwMCIsInN1Ym5ldF9pZCI6Ii9zdWJzY3JpcHRpb25zLzg2N2E4NzhiLWNiNjgtNGRlNS05NzQxLTM2MWFjOWUxNzhiNi9yZXNvdXJjZUdyb3Vwcy9zcy1kZXYtbmV0d29yay1yZy9wcm92aWRlcnMvTWljcm9zb2Z0Lk5ldHdvcmsvdmlydHVhbE5ldHdvcmtzL3NzLWRldi12bmV0L3N1Ym5ldHMvYWtzLTAwIn0seyJydWxlX25hbWUiOiJzaGFyZWQtc2VydmljZXMtZGV2LWFrczAxIiwic3VibmV0X2lkIjoiL3N1YnNjcmlwdGlvbnMvODY3YTg3OGItY2I2OC00ZGU1LTk3NDEtMzYxYWM5ZTE3OGI2L3Jlc291cmNlR3JvdXBzL3NzLWRldi1uZXR3b3JrLXJnL3Byb3ZpZGVycy9NaWNyb3NvZnQuTmV0d29yay92aXJ0dWFsTmV0d29ya3Mvc3MtZGV2LXZuZXQvc3VibmV0cy9ha3MtMDEifV0="
          - "env"                        = "aat"
          - "geoRedundantBackup"         = "Enabled"
          - "location"                   = "UK South"
          - "serverName"                 = "notification-service-staging-aat"
          - "skuCapacity"                = "2"
          - "skuName"                    = "GP_Gen5_2"
          - "skuSizeMB"                  = "51200"
          - "skuTier"                    = "GeneralPurpose"
          - "sslEnforcement"             = "Enabled"
          - "version"                    = "11"
        } -> null
      - resource_group_name = "notification-service-staging-data-aat" -> null
      - template_body       = jsonencode(
            {
              - "$schema"      = "http://schema.management.azure.com/schemas/2014-04-01-preview/deploymentTemplate.json#"
              - contentVersion = "1.0.0.0"
              - parameters     = {
                  - administratorLogin         = {
                      - maxLength = 16
                      - minLength = 1
                      - type      = "string"
                    }
                  - administratorLoginPassword = {
                      - type = "securestring"
                    }
                  - backupRetentionDays        = {
                      - defaultValue = 7
                      - type         = "string"
                    }
                  - charset                    = {
                      - type = "string"
                    }
                  - collation                  = {
                      - type = "string"
                    }
                  - commonTags                 = {
                      - type = "string"
                    }
                  - dbName                     = {
                      - type = "string"
                    }
                  - dbRules                    = {
                      - type = "string"
                    }
                  - env                        = {
                      - metadata = {
                          - description = "The tag"
                        }
                      - type     = "string"
                    }
                  - geoRedundantBackup         = {
                      - defaultValue = "Enabled"
                      - type         = "string"
                    }
                  - location                   = {
                      - allowedValues = [
                          - "UK West",
                          - "ukwest",
                          - "UK South",
                          - "uksouth",
                        ]
                      - defaultValue  = "UK South"
                      - type          = "string"
                    }
                  - serverName                 = {
                      - maxLength = 63
                      - minLength = 2
                      - type      = "string"
                    }
                  - skuCapacity                = {
                      - defaultValue = 2
                      - type         = "string"
                    }
                  - skuFamily                  = {
                      - allowedValues = [
                          - "Gen5",
                        ]
                      - defaultValue  = "Gen5"
                      - type          = "string"
                    }
                  - skuName                    = {
                      - allowedValues = [
                          - "B_Gen5_1",
                          - "B_Gen5_2",
                          - "GP_Gen5_2",
                          - "GP_Gen5_4",
                          - "GP_Gen5_8",
                          - "GP_Gen5_16",
                          - "GP_Gen5_32",
                          - "MO_Gen5_2",
                          - "MO_Gen5_4",
                          - "MO_Gen5_8",
                          - "MO_Gen5_16",
                          - "MO_Gen5_32",
                        ]
                      - defaultValue  = "GP_Gen5_2"
                      - type          = "string"
                    }
                  - skuSizeMB                  = {
                      - defaultValue = "51200"
                      - type         = "string"
                    }
                  - skuTier                    = {
                      - allowedValues = [
                          - "Basic",
                          - "GeneralPurpose",
                          - "MemoryOptimized",
                        ]
                      - defaultValue  = "GeneralPurpose"
                      - type          = "string"
                    }
                  - sslEnforcement             = {
                      - defaultValue = "Enabled"
                      - type         = "string"
                    }
                  - version                    = {
                      - allowedValues = [
                          - "9.5",
                          - "9.6",
                          - "10",
                          - "11",
                        ]
                      - defaultValue  = "9.6"
                      - type          = "string"
                    }
                }
              - resources      = [
                  - {
                      - apiVersion = "2017-12-01-preview"
                      - kind       = ""
                      - location   = "[parameters('location')]"
                      - name       = "[parameters('serverName')]"
                      - properties = {
                          - administratorLogin         = "[parameters('administratorLogin')]"
                          - administratorLoginPassword = "[parameters('administratorLoginPassword')]"
                          - sslEnforcement             = "[parameters('sslEnforcement')]"
                          - storageProfile             = {
                              - backupRetentionDays = "[int(parameters('backupRetentionDays'))]"
                              - geoRedundantBackup  = "[parameters('geoRedundantBackup')]"
                              - storageMB           = "[parameters('skuSizeMB')]"
                            }
                          - version                    = "[parameters('version')]"
                        }
                      - resources  = [
                          - {
                              - apiVersion = "2017-12-01-preview"
                              - dependsOn  = [
                                  - "[concat('Microsoft.DBforPostgreSQL/servers/', parameters('serverName'))]",
                                ]
                              - name       = "[parameters('dbName')]"
                              - properties = {
                                  - charset   = "[parameters('charset')]"
                                  - collation = "[parameters('collation')]"
                                }
                              - type       = "databases"
                            },
                        ]
                      - sku        = {
                          - capacity = "[parameters('skuCapacity')]"
                          - family   = "[parameters('skuFamily')]"
                          - name     = "[parameters('skuName')]"
                          - size     = "[parameters('skuSizeMB')]"
                          - tier     = "[parameters('skuTier')]"
                        }
                      - tags       = "[variables('tags')]"
                      - type       = "Microsoft.DBforPostgreSQL/servers"
                    },
                  - {
                      - apiVersion = "2017-12-01-preview"
                      - copy       = {
                          - count = "[length(variables('dbRules'))]"
                          - name  = "storagecopy"
                        }
                      - dependsOn  = [
                          - "[concat('Microsoft.DBforPostgreSQL/servers/', parameters('serverName'))]",
                        ]
                      - location   = "[parameters('location')]"
                      - name       = "[concat(parameters('serverName'), '/', variables('dbRules')[copyIndex()].rule_name)]"
                      - properties = {
                          - ignoreMissingVnetServiceEndpoint = true
                          - virtualNetworkSubnetId           = "[variables('dbRules')[copyIndex()].subnet_id]"
                        }
                      - type       = "Microsoft.DBforPostgreSQL/servers/virtualNetworkRules"
                    },
                ]
              - variables      = {
                  - dbRules = "[base64ToJson(parameters('dbRules'))]"
                  - tags    = "[base64ToJson(parameters('commonTags'))]"
                }
            }
        ) -> null
    }

  # module.reform-notifications-staging-db.null_resource.subnet_mappings[0] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "4688172926601691731" -> null
      - triggers = {
          - "rule_name" = "cftaks-tf-aks00"
          - "subnet_id" = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/virtualNetworks/cft-aat-vnet/subnets/aks-00"
        } -> null
    }

  # module.reform-notifications-staging-db.null_resource.subnet_mappings[1] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "8351565668699114759" -> null
      - triggers = {
          - "rule_name" = "cftaks-tf-aks01"
          - "subnet_id" = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/virtualNetworks/cft-aat-vnet/subnets/aks-01"
        } -> null
    }

  # module.reform-notifications-staging-db.null_resource.subnet_mappings[2] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "5866737013836605246" -> null
      - triggers = {
          - "rule_name" = "ase"
          - "subnet_id" = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/core-infra-aat/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-aat/subnets/core-infra-subnet-3-aat"
        } -> null
    }

  # module.reform-notifications-staging-db.null_resource.subnet_mappings[3] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "8993406615971320743" -> null
      - triggers = {
          - "rule_name" = "aks"
          - "subnet_id" = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/core-infra-aat/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-aat/subnets/aks"
        } -> null
    }

  # module.reform-notifications-staging-db.null_resource.subnet_mappings[4] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "1375901584291497213" -> null
      - triggers = {
          - "rule_name" = "jenkins-aks"
          - "subnet_id" = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-ptl-network-rg/providers/Microsoft.Network/virtualNetworks/cft-ptl-vnet/subnets/iaas"
        } -> null
    }

  # module.reform-notifications-staging-db.null_resource.subnet_mappings[5] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "7735119023765609204" -> null
      - triggers = {
          - "rule_name" = "jenkins-aks-agent"
          - "subnet_id" = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-ptl-network-rg/providers/Microsoft.Network/virtualNetworks/cft-ptl-vnet/subnets/aks-00"
        } -> null
    }

  # module.reform-notifications-staging-db.null_resource.subnet_mappings[6] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "1910792376674891304" -> null
      - triggers = {
          - "rule_name" = "shared-services-test-aks00"
          - "subnet_id" = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/virtualNetworks/ss-test-vnet/subnets/aks-00"
        } -> null
    }

  # module.reform-notifications-staging-db.null_resource.subnet_mappings[7] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "1694152728866580092" -> null
      - triggers = {
          - "rule_name" = "shared-services-test-aks01"
          - "subnet_id" = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/virtualNetworks/ss-test-vnet/subnets/aks-01"
        } -> null
    }

  # module.reform-notifications-staging-db.null_resource.subnet_mappings[8] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "8066575166077215523" -> null
      - triggers = {
          - "rule_name" = "shared-services-stg-aks00"
          - "subnet_id" = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/virtualNetworks/ss-stg-vnet/subnets/aks-00"
        } -> null
    }

  # module.reform-notifications-staging-db.null_resource.subnet_mappings[9] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "1334242056969265672" -> null
      - triggers = {
          - "rule_name" = "shared-services-stg-aks01"
          - "subnet_id" = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/virtualNetworks/ss-stg-vnet/subnets/aks-01"
        } -> null
    }

  # module.reform-notifications-staging-db.null_resource.subnet_mappings[10] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "6485705818459601547" -> null
      - triggers = {
          - "rule_name" = "bastion-nonprod-vnet"
          - "subnet_id" = "/subscriptions/b44eb479-9ae2-42e7-9c63-f3c599719b6f/resourceGroups/bastion-nonprod-rg/providers/Microsoft.Network/virtualNetworks/bastion-nonprod-vnet/subnets/bastion"
        } -> null
    }

  # module.reform-notifications-staging-db.null_resource.subnet_mappings[11] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "8064757874985901447" -> null
      - triggers = {
          - "rule_name" = "idam-aat2-vnet"
          - "subnet_id" = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/core-infra-idam-aat2/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-idam-aat2/subnets/core-infra-subnet-7-idam-aat2"
        } -> null
    }

  # module.reform-notifications-staging-db.null_resource.subnet_mappings[12] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "7287681128445747942" -> null
      - triggers = {
          - "rule_name" = "shared-services-dev-aks00"
          - "subnet_id" = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/virtualNetworks/ss-dev-vnet/subnets/aks-00"
        } -> null
    }

  # module.reform-notifications-staging-db.null_resource.subnet_mappings[13] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "6506471288084556246" -> null
      - triggers = {
          - "rule_name" = "shared-services-dev-aks01"
          - "subnet_id" = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/virtualNetworks/ss-dev-vnet/subnets/aks-01"
        } -> null
    }

  # module.reform-notifications-staging-db.random_string.password will be destroyed
  # (because random_string.password is not in configuration)
  - resource "random_string" "password" {
      - id          = "EmcFRHYKk?Y?yrY(" -> null
      - length      = 16 -> null
      - lower       = true -> null
      - min_lower   = 0 -> null
      - min_numeric = 0 -> null
      - min_special = 0 -> null
      - min_upper   = 0 -> null
      - number      = true -> null
      - numeric     = true -> null
      - result      = "EmcFRHYKk?Y?yrY(" -> null
      - special     = true -> null
      - upper       = true -> null
    }

Plan: 5 to add, 5 to change, 51 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":1541,"Program":"tfcmt","SHA1":"","Vars":{}} -->